// Part of MeasurementKit <https://measurement-kit.github.io/>.
// MeasurementKit is free software. See AUTHORS and LICENSE for more
// information on the copying conditions.
"app_name" = "ooniprobe";

"run_tests" = "執行測試";
"past_tests" = "過去的測試";
"settings" = "設定";
"about" = "關於";

"dns_injection" = "DNS注入";
"tcp_connect" = "TCP 連接";
"http_invalid_request_line" = "HTTP無效請求行";
"http_header_field_manipulation" = "HTTP　表頭欄操控";
"web_connectivity" = "萬維網連結度";
"ndt" = "NDT速度測試";
"dash" = "DASH Streaming Test";

"web_connectivity_desc" = "檢查網站是否被封鎖";
"http_invalid_request_line_desc" = "找尋'中間盒'";
"http_header_field_manipulation_desc" = "找尋'中間盒";
"ndt_desc" = "測量網路速度和表現";
"dash_desc" = "Measures video streaming quality";

"web_connectivity_longdesc" = "這個測試檢查網站的近用是否受到 DNS 竄改, TCP/IP 封鎖, 或是透明 HTTP 代理等方式而遭封鎖屏蔽。\n\nE每次執行萬維網連接度時，請試試不同的網站。";
"http_invalid_request_line_longdesc" = "這個測試試著透過無效HTTP請求行到一個回聲服務，以偵察可能是執行審查或監控的系統 (俗稱的“中間盒”)。如果這類系統存在於你的網路里，這個無效HTTP請求行將會被攔截而觸動一個錯誤。";
"http_header_field_manipulation_longdesc" = "這個測試試著傳送一個附不規則表頭的無效HTTP請求行到後端控制伺服器，以偵察可能是執行審查或監控的系統 (俗稱的“中間盒”)。如果這類系統存在於你的網路里，它們很可能正規化表頭或是增加額外的表頭。";
"ndt_longdesc" = "這個測試會計算你的網路速度和表現。\n\n免責聲明：這是一個基於第三方伺服器的第三方的表現測試。我們無法保證你的IP 地址不會被收集、處理與公布。";
"dash_longdesc" = "This test emulates a very simple video player streaming at variable quality from a remote server. The test is designed to obtain a baseline performance of your network for performing video streaming.\n\n Disclaimer: This is a third-party performance test based on third-party servers, and we cannot guarantee that your IP address will not be collected, processed, and published.";

"running_tests" = "執行測試";
"finished_tests" = "完成的測試";

"settings" = "設定";
"collector_address" = "收集器地址";

"cancel" = "取消";
"ok" = "OK";
"delete" = "刪除";

"test_result" = "測試結果";
"change" = "改變";

"welcome_ooniprobe" = "歡迎來到 ooniprobe!";
"get_started" = "准備開始！";

"what_is_ooniprobe" = "什麼是 ooniprobe?";
"learn_more" = "了解更多";

"risks_text_1" = "ooniprobe 是一個自由開源軟體可讓你來檢查網路中的網際網路審查！";
"risks_text_2" = "執行這個應用程式，你可以檢查網站是否遭到封鎖，以及如何被屏蔽，是否有審查或監控系統存在於你的網路中。";
"risks_text_3" = "你也可以執行這個應用程式，來測量網路的速度和表現。";
"risks_text_4" = "透過這個應用程式所收集的資料，可以用來作為審查事件的證據。";
"risks_text_5" = "因為 ooniprobe　可以作為調查工具等作用，它也帶有一些風險。";

"potential_risks" = "潛在風險";
"laws_text_1" = "任何人監控你的網路活動(如：ISP, 政府或上司)可能會知道我在執行ooniprobe(盡管OONI努力地讓這不易發生)";
"laws_text_2" = "在測試網站的審查狀況時，你會被連結或下載一些挑釁或可能被拒的網站(例如色情網站)資料，這些網站可能你的國家并不合法。";
"laws_text_3" = "OONI的 HTTP無效請求行測試可能會觸動ISP的懷疑，而將你的行為當成了一種破壞駭客行逕。";
"laws_text_4" = "除非有修改設定，所有測試所收集的數據將會默認地由 OONI 公布，其中可能有些私人的、可辨識的資訊。(雖然 OONI努力地防止此情況發生)";
"laws_text_5" = "只是使用ooniprobe可能被當成一種無視國家法律的間諜行為";
"laws_text_6" = "據我們所知，沒有任何 ooniprobe 使用者因使用我們的平台而面臨這些下場。然而有些國家的黑歷史習於對付倡議網路自由的活躍份子，有可能讓 ooniprobe 使用者因此而面臨了嚴厲的民事、刑事或法外處罰等威脅。";
"laws_text_6" = "據我們所知，沒有任何 ooniprobe 使用者因使用我們的平台而面臨這些下場。然而有些國家的黑歷史習於對付倡議網路自由的活躍份子，有可能讓 ooniprobe 使用者因此而面臨了嚴厲的民事、刑事或法外處罰等威脅。";
"i_understand_the_risks" = "我了解這些風險。";

"pop_quiz" = "彈出小測驗問題！";
"question_1" = "問題 1: 盡管OONI很謹慎地防止，但有人 (如：ISP, 政府或上司)還是可能會監控我的網路活動，因而知道我在執行ooniprobe？";
"question_2" = "問題 2: 我的測量結果預設會被OONI公布，其可能包含可以辨識個人資訊的訊息？";
"true" = "是";
"false" = "否";
"how_did_i_do" = "我如何做到？";

"wrong" = "還有一點需要閱讀了解後才能再繼續。";
"correct" = "做得好！你正確地回答了問題。";

"set_up_sharing" = "設定分享";
"include_ip" = "包括你的網路連線服務商？";
"include_asn" = "包含你的網路資訊？";
"include_cc" = "包含你的國家？";
"upload_results" = "公開分享結果？";
"settings_text" = "所有測量都會預設送到OONI的測量收集器，並自動地公布到OONI explorer 以及 OONI的測量表單上。";
"im_all_set" = "都弄好了！";
"ooniprobe_configured" ="成功地設定好 ooniprobe 一切設定都生效了！";

"about_ooni" = "關於 OONI";
"about_text_1" = "OONI 是TOR計畫底下的一個自由軟體專案，旨在增加全球網際網路審查的透明度。";
"about_text_2" ="自2012, OONI 已收集了全世界上百萬個網路測量，篩出多個互聯網審查與流量操縱的實例。";
"learn_more" = "了解更多";

"run" = "執行";
"view" = "檢視";

"no_result" = "無結果";
"no_result_msg" = "測試無結果或是它遭到中止";

"local_notifications" = "執行測試提醒";
"local_notifications_time" = "時間";
"local_notifications_text" = "執行測試的時間";

"notifications" = "通知";

"max_runtime" = "萬維網連接度最大執行時間 (秒)";
"advanced_settings" = "進階設定";
"finished_running" = "%@ 完成執行";
"view_log" = "檢視記錄";
"copy_to_clipboard" = "復制到剪貼簿";
"copied_clipboard" = "復制入剪貼簿";
"send_crash" = "送出崩壞出錯報告";
"privacy" = "隱私";
"view_data_policy" = "點這里來查看我們的資料政策";
"test_name_finished" = "%@ 完成，請到過去測試來看其結果";
"open_url_alert" = "你要開啟下列的網址嗎？";
"max_runtime_low" = "你輸入的最大執行時間太小了，改為預設";
"clear_all_tests_alert" = "你要刪除所有測試的結果嗎？";
"past_tests_empty" = "一旦測試完成執行，過去的測試結果將會立即出現在此";

"try_mirror" = "Try mirror";
"loading" = "Loading...";
